<?php
    $array = [ "text1", 'text2', "text1", "text1", "text1", "text1", "text1"]
?>



<section class="main__about">
    <div class="container">
        <div class="head">
            <h2>
                О нашей компании
            </h2>
            <div class="head__line main__about_head__line"></div>
        </div>


        <div class="main__about_content">
            <div class="main__about_content_text">
                <p>
                    На этом месте текст о компании. Мы не просто продаем оборудование, а предлагаем удобный маркетинговый инструмент, который повысит ваши продажи.
                </p>

                <p>
                        У нас самый высокий процент сбора mac-адресов и действительно удобный и полезный личный кабинет, который откроет для вас возможности Big Data, позволит обогатить данные о клиентах и вычислить оффлайн-конверсию, в конечном итоге снизив расходы на рекламу на 80%.
                </p>
                <button class="button main__about_button ">Подробнее о нас </button>
            </div>

            <div class="map_region" style="width: 100%; position: relative; z-index: 200">
                <object id="object" type="image/svg+xml" data="templates/assets/img/tt.svg" >

                </object>
                <svg class="placemark" id="placemark1" x="100" y="100"  viewBox="0 0 37 34" width="5%" xmlns="http://www.w3.org/2000/svg">
                    <path d="M18.4997 2.83334C12.5396 2.83334 7.70801 7.27318 7.70801 12.75C7.70801 19.8333 18.4997 31.1667 18.4997 31.1667C18.4997 31.1667 29.2913 19.8333 29.2913 12.75C29.2913 7.27318 24.4598 2.83334 18.4997 2.83334ZM18.4997 16.2917C16.3706 16.2917 14.6455 14.7064 14.6455 12.75C14.6455 10.7936 16.3706 9.20834 18.4997 9.20834C20.6287 9.20834 22.3538 10.7936 22.3538 12.75C22.3538 14.7064 20.6287 16.2917 18.4997 16.2917Z" fill="#7C0905"/>
                </svg>
                <svg class="placemark" id="placemark2" x="100" y="100"  viewBox="0 0 37 34" width="5%" xmlns="http://www.w3.org/2000/svg">
                    <path d="M18.4997 2.83334C12.5396 2.83334 7.70801 7.27318 7.70801 12.75C7.70801 19.8333 18.4997 31.1667 18.4997 31.1667C18.4997 31.1667 29.2913 19.8333 29.2913 12.75C29.2913 7.27318 24.4598 2.83334 18.4997 2.83334ZM18.4997 16.2917C16.3706 16.2917 14.6455 14.7064 14.6455 12.75C14.6455 10.7936 16.3706 9.20834 18.4997 9.20834C20.6287 9.20834 22.3538 10.7936 22.3538 12.75C22.3538 14.7064 20.6287 16.2917 18.4997 16.2917Z" fill="#7C0905"/>
                </svg>
                <svg class="placemark" id="placemark3" x="100" y="100"  viewBox="0 0 37 34" width="5%" xmlns="http://www.w3.org/2000/svg">
                    <path d="M18.4997 2.83334C12.5396 2.83334 7.70801 7.27318 7.70801 12.75C7.70801 19.8333 18.4997 31.1667 18.4997 31.1667C18.4997 31.1667 29.2913 19.8333 29.2913 12.75C29.2913 7.27318 24.4598 2.83334 18.4997 2.83334ZM18.4997 16.2917C16.3706 16.2917 14.6455 14.7064 14.6455 12.75C14.6455 10.7936 16.3706 9.20834 18.4997 9.20834C20.6287 9.20834 22.3538 10.7936 22.3538 12.75C22.3538 14.7064 20.6287 16.2917 18.4997 16.2917Z" fill="#7C0905"/>
                </svg>
                <svg class="placemark" id="placemark4" x="100" y="100"  viewBox="0 0 37 34" width="5%" xmlns="http://www.w3.org/2000/svg">
                    <path d="M18.4997 2.83334C12.5396 2.83334 7.70801 7.27318 7.70801 12.75C7.70801 19.8333 18.4997 31.1667 18.4997 31.1667C18.4997 31.1667 29.2913 19.8333 29.2913 12.75C29.2913 7.27318 24.4598 2.83334 18.4997 2.83334ZM18.4997 16.2917C16.3706 16.2917 14.6455 14.7064 14.6455 12.75C14.6455 10.7936 16.3706 9.20834 18.4997 9.20834C20.6287 9.20834 22.3538 10.7936 22.3538 12.75C22.3538 14.7064 20.6287 16.2917 18.4997 16.2917Z" fill="#7C0905"/>
                </svg>
                <svg class="placemark" id="placemark5" x="100" y="100"  viewBox="0 0 37 34" width="5%" xmlns="http://www.w3.org/2000/svg">
                    <path d="M18.4997 2.83334C12.5396 2.83334 7.70801 7.27318 7.70801 12.75C7.70801 19.8333 18.4997 31.1667 18.4997 31.1667C18.4997 31.1667 29.2913 19.8333 29.2913 12.75C29.2913 7.27318 24.4598 2.83334 18.4997 2.83334ZM18.4997 16.2917C16.3706 16.2917 14.6455 14.7064 14.6455 12.75C14.6455 10.7936 16.3706 9.20834 18.4997 9.20834C20.6287 9.20834 22.3538 10.7936 22.3538 12.75C22.3538 14.7064 20.6287 16.2917 18.4997 16.2917Z" fill="#7C0905"/>
                </svg>
                <svg class="placemark" id="placemark6" x="100" y="100"  viewBox="0 0 37 34" width="5%" xmlns="http://www.w3.org/2000/svg">
                    <path d="M18.4997 2.83334C12.5396 2.83334 7.70801 7.27318 7.70801 12.75C7.70801 19.8333 18.4997 31.1667 18.4997 31.1667C18.4997 31.1667 29.2913 19.8333 29.2913 12.75C29.2913 7.27318 24.4598 2.83334 18.4997 2.83334ZM18.4997 16.2917C16.3706 16.2917 14.6455 14.7064 14.6455 12.75C14.6455 10.7936 16.3706 9.20834 18.4997 9.20834C20.6287 9.20834 22.3538 10.7936 22.3538 12.75C22.3538 14.7064 20.6287 16.2917 18.4997 16.2917Z" fill="#7C0905"/>
                </svg>
                <svg class="placemark" id="placemark7" x="100" y="100"  viewBox="0 0 37 34" width="5%" xmlns="http://www.w3.org/2000/svg">
                    <path d="M18.4997 2.83334C12.5396 2.83334 7.70801 7.27318 7.70801 12.75C7.70801 19.8333 18.4997 31.1667 18.4997 31.1667C18.4997 31.1667 29.2913 19.8333 29.2913 12.75C29.2913 7.27318 24.4598 2.83334 18.4997 2.83334ZM18.4997 16.2917C16.3706 16.2917 14.6455 14.7064 14.6455 12.75C14.6455 10.7936 16.3706 9.20834 18.4997 9.20834C20.6287 9.20834 22.3538 10.7936 22.3538 12.75C22.3538 14.7064 20.6287 16.2917 18.4997 16.2917Z" fill="#7C0905"/>
                </svg>

                <?php foreach ($array as $index => $text) :?>
                    <div id="hover-text<?=($index + 1)?>" class="hover-text">
                        <p><b><?=$text?></b></p>
                        <?=$text?>
                    </div>
                <?endforeach;?>
            </div>
        </div>
    </div>
</section>

<script>

</script>